Tekla.Structures.Drawing.CannotPerformOperationDrawingIsActiveException
The CannotPerformOperationDrawingIsActiveException class defines the
exception that is thrown when a user tries to do an operation which
requires that the drawing is not active.

Tekla.Structures.Drawing.CannotPerformOperationDrawingIsActiveException.#ctor(System.String)
Creates a new cannot perform operation drawing is active exception instance.
Message: The exception message.

Tekla.Structures.Drawing.CannotPerformOperationDrawingIsActiveException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.